
## Plan Result

[CI link](https://github.com/asa1984/infra/actions/runs/13352082278)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository_ruleset.infra_main


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_repository_ruleset.infra_main will be created
  + resource "github_repository_ruleset" "infra_main" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "mainブランチの保護"
      + node_id     = (known after apply)
      + repository  = "infra"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }

          + required_status_checks {
              + required_check {
                  + context        = "ci"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"51ed64d0eabd451ed549cb209bd926e3be0fefd6","Vars":{},"WorkflowName":"CI"} -->